[
    {
        "term": "One",
        "introduction": "For my first work term in the Fall 2019, I worked at the University of Guelph in the Communications and Public Affairs department, more specifically within the marketing/web team",
        "employer": {
            "name": "University of Guelph - Communications and Public Affairs (C&PA)",
            "description": "The office of Communications and Public Affairs handles several aspects of the University of Guelph's public presence. The department itself is split into different teams: the News Service team oversees, media relations and the online news site, the Portico alumni magazine which keeps thousands of U of G graduates connected through print and online media, and the web & social media team which manages several of the university's key webpages (such as the homepage and campus map)."
        },
        "job": {
            "title": "Front End Web Developer",
            "description": "I joined C&PA as a part of the web team in September 2019 and was given the project of redesigning the campus map. This project was a part of a larger web presence redesign that was already in the works before my term. The project had many aspects such as ensuring it complied with AODA standards, refactoring how the map/campus data was gathered, researching map technologies, but mainly focused on the front-end redesign of the desktop site, while also creating a new mobile site. Although the campus map project was my main focus, I also assisted my team with the rest of the web redesign and data entry/gathering for other projects. This role provided not only web design/implementation experience but also project management experience as I self-managed the map project, with my supervisor and other coworker acting in a more guiding/assisting role. I gained several skills that are not only transferable to my career/academic life but also in my everyday life (working in a team, project and time management, conflict resolution, etc.). I also got exposure to many of the industry-standard tools such as Sass/CSS, HTML/Bootstrap, Javascript/jQuery, PHP, Git as well as production APIs like the Google Maps API."
        },
        "goals": [
            "My first goal was to increase my working knowledge of web development and design (specifically with JavaScript and PHP) as when I had first started, I only knew the very basics. I wanted to start with experimenting with JavaScript and PHP, just to see what I was capable of doing and what I needed to learn. For the project, I needed to use the Google Maps API and jQuery, and it was through experimenting with both that I learned a lot about JavaScript, its benefits, detriments and overall syntax. As the term progressed I feel I became not only a better JavaScript programmer but a better programmer in general. I researched a lot of the best practices, and what modern web programming is like by speaking with my co-workers and learning from them. In the front-end aspect of web development, I achieved my goal, but with the back-end, I still feel there is more to learn but this was mainly to the fact, that the project didn't require too much back-end programming. Although, I did learn more about PHP and backend technologies in general, for the future I want to delve more deeply into back-end web development.",
            "My second goal was to learn more UI/design techniques as well as the technologies used in web UIs. One of the most important aspects of the map project was creating a better desktop UI as well as a brand new mobile UI. I researched what others online and other university websites were designed, I looked at what people liked about them and what they didn't. With the knowledge I gained from this and from the help I received from our designer, I feel confident in my abilities to create good looking and functional interfaces. Another aspect of UI design I wanted to better understand was accessibility. The map had to conform to the AODA standards for web pages and by ensuring it did, I learned a lot about how many different aspects of UI design play a role in how accessible a page is to those with disabilities. (such as color, and page structure). By the end of my term, I felt as if I had completed this goal, as I started off knowing very little about design, to being able to create/design a website fit for the university.",
            "My third and final goal was to improve my oral communication skills between co-workers in both a group setting and on an individual level. One of the biggest things I wanted to work on was presenting my ideas more clearly and understandably. I planned to start outlining the key points behind my ideas in my head before I would present them to my co-workers. I would also ask more questions when a task I was giving was unclear to me or I didn't know where to start from. Throughout my work term, I feel I had taken my plan into action but I still feel I have much more room to improve before I feel I completed the goal. This is because I still need to get more comfortable with talking in a larger group setting (such as in department meetings). In the future, I would like to put my self in more situations where I am required to speak in the hopes that I can learn from the experiences and improve that way."
        ],
        "conclusion": "My time at C&PA provided with lots of knowledge of web development and UI design and gave me the chance to manage my project and work with others in a team setting. The skill I gained here are ones that I will take with me for the rest of my academic and work career. My co-workers provided me with lots of support and helped me grow as a person. In particular, I would like to thank my supervisor James Harris and fellow co-worker Linda Marciniak."
    },
    {
        "term": "Two",
        "introduction": "For my second work term in the Summer 2020, I rejoined the web team at the University of Guelph, Communications and Public Affairs department.",
        "employer": {
            "name": "University of Guelph - Communications and Public Affairs (C&PA)"
        },
        "job": {
            "title": "Front End Web Developer",
            "description": "This work term was significantly different, due to the COVID-19 pandemic causing it to be work from home. Working from home was definetly a new experience, one that was a welcome challenge and was handled very well by my manager and fellow co-workers. This work term differed from the last also due to a single project longer being the focus and instead several mini projects as well as small tasks in the backlog. I started the work term by continuing my past work on the campus map. This consisted of fixing any bugs discovered while I was gone, finishing features we hadn't finished, as well as introducing new features suggested by user feedback. Once we felt that enough work had been done on the campus map, I started my next project which was to create a demo page for the UI-Kit used by various developers/designers at the University of Guelph to make campus related websites. The next mini project was the website header, this was a special project as it was a collabration between C&PA (My department) and CCS (Computing & Communications Services, University of Guelph's main IT department). The header was made by C&PA and CCS wanted a version that mimiced the same look and feel but that would worked with their existing pipeline/frameworks. So I suggested we create a Web Component version of the header, that worked framework independant and this became my project for the remainder of the semester."
        },
        "goals": [
            "My first goal was to improve on my written and oral communication skills between co-workers in both a group setting and on an individual level, this was a goal that carried over from my first work term, as I felt that I still had plenty of room for improvement. As the job was work from home and not in person, there weren't as many opportunities to improve on oral communication (at least in a face to face manner) but I still wanted to try to speak out during our online meetings whenever necessary. As was the case in the last term, I planned to ask more questions, ask for feedback from co-workers, and to be more comfortable presenting in groups. I felt a big measure of success/improvement when I presented my idea for the Web Component version of the header, as it was one of the first times I was very comfortable communicating my ideas in a group environment. The same can also be said for my written communication, as I feel I have made major strides in the improvement of both skills.",
            "My second goal was to improve my skills related to debugging and optimizing code as there were many times in my last term, where I had to spend lots of time fixing bugs. My plan involved learning to use the debuggers provide by modern web browsers such as Google Chrome and Firefox and other tools used by developers to assist in debugging. I also researched the best practices for JavaScript development, which helped me in making code that had fewer bugs, to begin with, and was more efficient. This was particularly useful when we had encountered a bug which we were stuck on for days, but with the knowledge I had gained from my research, I was able to use the tools I learned about to solve the bug easily. Overall, I feel as though I have succeeded in reaching this goal, but there is always more to learn, and especially with web development, best practices are constantly changing.",
            "My final goal was to further strengthen my working knowledge of web development technologies such as Javascript, PHP, and Sass. This is similar to my goal in the previous term as I felt there was much more for me to still learn especially relating to Sass and PHP. I started by reading through both the documentation and tutorials on the Sass website which taught me alot of best practices as well as the benefits of Sass. For PHP, I read the documentation online and looked for more opportunities to use PHP for both server-side rendering and scripting. With JavaScript, I wanted to learn more native APIs rather than using jQuery. The MDN (Mozilla Developer Network) lent a hand in translating jQuery into native JavaScript equivalents. The skills I gained from there were important for the header web component as it needed to work in situations where jQuery wasn't available. All of these things came together to provide a great wealth of experience and knowledge of web development, so I believe I reached this goal. But as I previously mentioned, as web development is a shifting domain, there will always be more to learn."
        ],
        "conclusion": "This semester further helped in developing my skills in not only web development but in time managment, project managment, working with a team and how to face unknown circumstances. I would really like to thank the teams at CCS and C&PA for providing the opportunity for me to showcase my abilities. I also must give huge thanks to my manager James Harris, who was an immense help in the transition from working in person to working from home as well as dealing with all the challenges that came because of the COVID-19 pandemic."
    }
]